//Задача 1 Един от начините да се прецени дали ще има дълготрайни последствия след проливен дъжд е да се намери количеството вода
//което се натрупва определено време след валежа.Вашата задача е да напишете програма, която по карта на терена намира колко
//е минималното количество валежи в литри, при което се достига определено наваляло количество вода.Програмата ви трябва да
//приема на входа данни за височината на терена в правоъгълна област със зададени размери.Височината се дефинира с реално
//число, което представлява средната височина на всеки под - регион с размер 10см на 10см.

//Входът на програмата започва с две цели числа - размерите на областта в сантиметри, след което за всеки под - регион
//по едно реално число - неговата височина, отново в сантиметри.Накрая се подава едно реално число - минималната очаквана  височина(в см) на водата на терена след валежа.

//Изходът на програмата трябва да е реално число, което представлява минималнoтo количество валеж в литри,
//при което се достига такава минимална височина на задържалата се вода.Точността на резултата да е до 2 десетични знака след запетаята.

//Общата сума на водата се намира като сумата от водата във всеки под - регион.Водата в един под - регион
//се намира от височината на региона и височината на водата в този под - регион.Един кубичен метър вода съдържа 1000 литра.Валежът е равномерен във всяка една точка.

//Максималният размер на областта е 100м на 100м.

#include <iostream>

bool submerged(int minWater, int heigth[]) {


	
	//for (int c = 0; c > 0; c++) {
	//	if (minWater > heigth[c]) {
	//		return true;
	//	}
	//	return false;
	//}
	
}


//10*10*minimalna visochina


int main() {
	int lengthTotal, widthTotal;
	int heigth[100];
	int regions = 0;
	int minWaterHeigth;
	float minWaterVolume;
	std::cout << "Length: "; std::cin >> lengthTotal;
	std::cout << std::endl;
	std::cout << "Width: "; std::cin >> widthTotal;
	std::cout << std::endl;
	int areaTotal= lengthTotal * widthTotal;
	//for (area; area > 0;) {
	//	area = area - 100;
	//	std::cout << "Region " << regions + 1 << " heigth: ";
	//	std::cin >> heigth[regions];
	//	std::cout << std::endl;
	//	regions++;
	//}
	//1 litur = 100 kv. cm X 1 cm
	std::cout << "MinWater: ";
	std::cin >> minWaterHeigth;
	std::cout << std::endl;

	double rainfall;

}